src/main/resources/json/sample.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:loc="http://www.csapi.org/schema/parlayx/ussd/send/v1_0/local">
    <soapenv:Header>
        <RequestSOAPHeader xmlns:tns="http://www.huawei.com.cn/schema/common/v2_1">
            <spId>2340110005999</spId>
            <spPassword>EBE4FDDA369EF289CF77210F6E0FFF9B</spPassword>
            <serviceId>234012000023788</serviceId>
            <timeStamp>20170110154245</timeStamp>
            <OA>2348138075679</OA>
            <FA>2348138075679</FA>
            <linkid></linkid>
        </RequestSOAPHeader>
    </soapenv:Header>
    <soapenv:Body>
        <loc:sendUssd>
            <loc:msgType>0</loc:msgType>
            <loc:senderCB>155932408</loc:senderCB>
            <loc:receiveCB></loc:receiveCB>
            <loc:ussdOpType>1</loc:ussdOpType>
            <loc:msIsdn>2348131631151</loc:msIsdn>
            <loc:serviceCode>55019</loc:serviceCode>
            <loc:codeScheme>68</loc:codeScheme>
            <loc:ussdString>This is the menu</loc:ussdString>
            <loc:endPoint>http://154.113.0.202:8087/api/v1.0/ussd/notify</loc:endPoint>
        </loc:sendUssd>
    </soapenv:Body>
</soapenv:Envelope>